Revit 2027 API
CodeCheckingParameterServiceData Properties
The CodeCheckingParameterServiceData type exposes the following members.
Properties
Name | Description
Document |  The current document.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
CodeCheckingParameterServiceData Class
Autodesk.Revit.DB.Structure Namespace